Project/Toir/src/Catalogs/НоменклатураКласса/НоменклатураКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураКласса</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитНоменклатуруКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектТОиР</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/ЗначенияСчетчиков/ЗначенияСчетчиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияСчетчиков</name>
  <resources>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерРодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счетчик</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/СтатусыОбъектовНСИ/СтатусыОбъектовНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбъектовНСИ</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НаОбработке</name>
  </enumValues>
  <enumValues>
    <name>Активный</name>
  </enumValues>
  <enumValues>
    <name>НеАктивный</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/РежимыКонтроляДублей/РежимыКонтроляДублей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыКонтроляДублей</name>
  <enumValues>
    <name>НеИспользовать</name>
  </enumValues>
  <enumValues>
    <name>ВПределахКласса</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/НоменклатураКласса/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Счетчик", Справочники.Счетчики.СчетчикЧерновиков);
		Запрос.УстановитьПараметр("Объект", Ссылка);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияСчетчиков.НомерПоСчетчику
			|ИЗ
			|	РегистрСведений.ЗначенияСчетчиков КАК ЗначенияСчетчиков
			|ГДЕ
			|	ЗначенияСчетчиков.Счетчик = &Счетчик
			|	И ЗначенияСчетчиков.Объект = &Объект";
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			НомерПоСчетчику = Результат.НомерПоСчетчику;
		Иначе
			НомерПоСчетчику = ШаблоныСтрокСервер.ПолучитьНовоеЗначениеСчетчика(Справочники.Счетчики.СчетчикЧерновиков, 1);
		КонецЕсли;
	Иначе
		НомерПоСчетчику = ШаблоныСтрокСервер.ПолучитьНовоеЗначениеСчетчика(Справочники.Счетчики.СчетчикЧерновиков, 1);
	КонецЕсли;
	Код = ШаблоныСтрокКлиентСервер.ФорматироватьСтроку(Формат(НомерПоСчетчику, "ЧГ=0"), """Ч""!0000000000000000000");
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Родитель = Справочники.НоменклатураКласса.ПолучитьРодителяПоКлассу(Класс);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЭтоГруппа Тогда
		ЗаписатьЗначенияСчетчиков();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	КонтрольДублейПоНаименованию(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьЗначенияСчетчиков()
	
	ЗаписатьНомерПоСчетчику = (НомерПоСчетчику > 0);
	ПодчиненРодителю = Ложь;
	НомерРодителя = 0;
	
	РеквизитыКласса = ?(ЗначениеЗаполнено(Класс), 
		УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъекта(
			Класс, "СчетчикНоменклатуры, ШаблонКодаНоменклатуры"), Неопределено);
	СчетчикНоменклатурыЗаполнен = 
		ПрисвоенНомерПоШаблону И ЗначениеЗаполнено(Класс) И ЗначениеЗаполнено(РеквизитыКласса.СчетчикНоменклатуры);
	СчетчикНоменклатуры = ?(СчетчикНоменклатурыЗаполнен,
		РеквизитыКласса.СчетчикНоменклатуры, Справочники.Счетчики.СчетчикЧерновиков);
	
	Если ЗаписатьНомерПоСчетчику И СчетчикНоменклатурыЗаполнен Тогда
		СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Класс, 
			"ШаблонКодаКласса, СчетчикКлассов, ПрисвоенНомерПоШаблону, НомерПоСчетчику, ШагСчетчика");
		УровеньОбъекта  = СписокРодителей.Количество() + 1;
		ШаблонРодителя  = Справочники.Классы.ПолучитьЗначениеРодителя(
			СписокРодителей, УровеньОбъекта - 2, "ШаблонКодаКласса");
		СчетчикРодителя = ШаблоныСтрокСервер.ПолучитьСчетчикДляУровня(
			ШаблонРодителя, УровеньОбъекта - 2, СписокРодителей, "СчетчикКлассов");
		
		РеквизитыРодителя = СписокРодителей[УровеньОбъекта - 2];
		ПодчиненРодителю = (НЕ СчетчикРодителя = Неопределено
		    И СчетчикРодителя.Счетчик = СчетчикНоменклатуры
			И РеквизитыРодителя.ШагСчетчика > ШагСчетчика);
		НомерРодителя = ?(ПодчиненРодителю И РеквизитыРодителя.ПрисвоенНомерПоШаблону, РеквизитыРодителя.НомерПоСчетчику, 0);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСчетчиков.Счетчик,
		|	ЗначенияСчетчиков.НомерПоСчетчику,
		|	ЗначенияСчетчиков.НомерРодителя
		|ИЗ
		|	РегистрСведений.ЗначенияСчетчиков КАК ЗначенияСчетчиков
		|ГДЕ
		|	ЗначенияСчетчиков.Объект = &Объект";
	ЗаписанныеЗначения = Запрос.Выполнить().Выгрузить();
	// Удаляем лишние записи регистра "ЗначенияСчетчиков".
	Если ЗаписанныеЗначения.Количество() > 0 Тогда
		// Из списка удаляемых исключаем правильную запись.
		Если ЗаписатьНомерПоСчетчику Тогда
			Найдено = ЗаписанныеЗначения.НайтиСтроки(Новый Структура("Счетчик", СчетчикНоменклатуры));
			Если Найдено.Количество() > 0 Тогда
				ЗаписатьНомерПоСчетчику = 
					(НЕ Найдено[0].НомерПоСчетчику = НомерПоСчетчику ИЛИ НЕ Найдено[0].НомерРодителя = НомерРодителя);
				ЗаписанныеЗначения.Удалить(Найдено[0]);
			КонецЕсли;
		КонецЕсли;
			
		Для Каждого ЗаписьКУдалению ИЗ ЗаписанныеЗначения Цикл
			Запись = РегистрыСведений.ЗначенияСчетчиков.СоздатьМенеджерЗаписи();
			Запись.Счетчик = ЗаписьКУдалению.Счетчик;
			Запись.Объект  = Ссылка;
			Запись.Удалить();
		КонецЦикла;
	КонецЕсли;
	
	Если ЗаписатьНомерПоСчетчику Тогда
		
		Запись = РегистрыСведений.ЗначенияСчетчиков.СоздатьМенеджерЗаписи();
		
		Запись.Объект          = Ссылка;
		Запись.Счетчик         = СчетчикНоменклатуры;
		Запись.НомерПоСчетчику = НомерПоСчетчику;
		Запись.НомерРодителя   = НомерРодителя;
		
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура КонтрольДублейПоНаименованию(Отказ)
	
	Если НЕ Статус = Перечисления.СтатусыОбъектовНСИ.Активный Тогда
		Возврат;
	КонецЕсли;
	
	// Контроль наличия дублей по наименованию
	СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Класс, 
		"РежимКонтроляДублейПоНаименованию, КонтрольДублейВПределахКласса");
	КолВо = СписокРодителей.Количество();
	
	РежимКонтроляДублейПоНаименованию = СписокРодителей[КолВо - 1].РежимКонтроляДублейПоНаименованию;
	КонтрольДублейВПределахКласса     = СписокРодителей[КолВо - 1].КонтрольДублейВПределахКласса;
	
	Если НЕ ЗначениеЗаполнено(РежимКонтроляДублейПоНаименованию) Тогда
		ДанныеКонтроляДублей = Справочники.Классы.ПолучитьРежимКонтроляДублейПоНаименованию(СписокРодителей);
		РежимКонтроляДублейПоНаименованию = ДанныеКонтроляДублей.РежимКонтроляДублейПоНаименованию;
		КонтрольДублейВПределахКласса     = ДанныеКонтроляДублей.КонтрольДублейВПределахКласса;
	КонецЕсли;
	
	Если РежимКонтроляДублейПоНаименованию = Перечисления.РежимыКонтроляДублей.ВПределахКласса Тогда
		Если НЕ ЗначениеЗаполнено(КонтрольДублейВПределахКласса) Тогда
			КонтрольДублейВПределахКласса = Класс;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",       Ссылка);
		Запрос.УстановитьПараметр("Класс",        КонтрольДублейВПределахКласса);
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НоменклатураКласса.Ссылка) КАК КолВо
			|ИЗ
			|	Справочник.НоменклатураКласса КАК НоменклатураКласса
			|ГДЕ
			|	НоменклатураКласса.Класс В ИЕРАРХИИ(&Класс)
			|	И НоменклатураКласса.Наименование = &Наименование
			|	И НЕ НоменклатураКласса.Ссылка = &Ссылка
			|	И НоменклатураКласса.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбъектовНСИ.Активный)";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.КолВо > 0 Тогда
			Если Выборка.КолВо = 1 Тогда
				ШаблонОшибки = НСтр("ru='Обнаружен 1 дубль номенклатуры с наименованием ''%1''. 
					|Нельзя записать две номенклатуры класса с одним наименованием в статусе ''Активный''.'")
			ИначеЕсли Выборка.КолВо > 1 Тогда
				ШаблонОшибки = НСтр("ru='Обнаружено дублей номенклатуры с наименованием ''%1'': %2. 
					|Нельзя записать более одной номенклатуры класса с одним наименованием в статусе ''Активный''.'")
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОшибки, Наименование, Выборка.КолВо), , , , Отказ);
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
